droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xs_dev_cfg_regs.xml
	<register id="SOFTPRES1" width="32" page="1" offset="0x84" internal="0" description="EMIF Software Reset register">
		<bitfield id="EMIF1" description="EMIF1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="EMIF2" description="EMIF2 software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES2" width="32" page="1" offset="0x86" internal="0" description="Peripheral Software Reset register">
		<bitfield id="EPWM1" description="EPWM1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM2" description="EPWM2 software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM3" description="EPWM3 software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM4" description="EPWM4 software reset bit" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM5" description="EPWM5 software reset bit" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM6" description="EPWM6 software reset bit" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM7" description="EPWM7 software reset bit" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM8" description="EPWM8 software reset bit" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM9" description="EPWM9 software reset bit" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM10" description="EPWM10 software reset bit" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM11" description="EPWM11 software reset bit" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="EPWM12" description="EPWM12 software reset bit" begin="11" end="11" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES3" width="32" page="1" offset="0x88" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ECAP1" description="ECAP1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="ECAP2" description="ECAP2 software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="ECAP3" description="ECAP3 software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="ECAP4" description="ECAP4 software reset bit" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="ECAP5" description="ECAP5 software reset bit" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="ECAP6" description="ECAP6 software reset bit" begin="5" end="5" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES4" width="32" page="1" offset="0x8a" internal="0" description="Peripheral Software Reset register">
		<bitfield id="EQEP1" description="EQEP1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="EQEP2" description="EQEP2 software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="EQEP3" description="EQEP3 software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES6" width="32" page="1" offset="0x8e" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SD1" description="SD1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="SD2" description="SD2 software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES7" width="32" page="1" offset="0x90" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SCI_A" description="SCI_A software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="SCI_B" description="SCI_B software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="SCI_C" description="SCI_C software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="SCI_D" description="SCI_D software reset bit" begin="3" end="3" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES8" width="32" page="1" offset="0x92" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SPI_A" description="SPI_A software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="SPI_B" description="SPI_B software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="SPI_C" description="SPI_C software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES9" width="32" page="1" offset="0x94" internal="0" description="Peripheral Software Reset register">
		<bitfield id="I2C_A" description="I2C_A software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="I2C_B" description="I2C_B software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES11" width="32" page="1" offset="0x98" internal="0" description="Peripheral Software Reset register">
		<bitfield id="McBSP_A" description="McBSP_A software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="McBSP_B" description="McBSP_B software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="USB_A" description="USB_A software reset bit" begin="16" end="16" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES13" width="32" page="1" offset="0x9c" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ADC_A" description="ADC_A software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="ADC_B" description="ADC_B software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="ADC_C" description="ADC_C software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="ADC_D" description="ADC_D software reset bit" begin="3" end="3" width="1" rwaccess="R/W"/>
	</register>
	<register id="SOFTPRES14" width="32" page="1" offset="0x9e" internal="0" description="Peripheral Software Reset register">
		<bitfield id="CMPSS1" description="CMPSS1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS2" description="CMPSS2 software reset bit" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS3" description="CMPSS3 software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS4" description="CMPSS4 software reset bit" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS5" description="CMPSS5 software reset bit" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS6" description="CMPSS6 software reset bit" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS7" description="CMPSS7 software reset bit" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="CMPSS8" description="CMPSS8 software reset bit" begin="7" end="7" width="1" rwaccess="R/W"/>
	</register>
